export type TechType = 'XGS-PON' | 'GPON' | 'PLANNED';

export interface CoverageAddress {
    id: number;
    street: string;
    house: string;
    lat: number;
    lng: number;
    techType: TechType;
}

export const coverageAddresses: CoverageAddress[] = [
    {
        "id": 1,
        "street": "Азовська",
        "house": "20",
        "lat": 50.41502872787688,
        "lng": 30.48182967081431,
        "techType": "XGS-PON"
    },
    {
        "id": 2,
        "street": "Азовська",
        "house": "22",
        "lat": 50.437987288759444,
        "lng": 30.474133340818547,
        "techType": "XGS-PON"
    },
    {
        "id": 3,
        "street": "Азовська",
        "house": "8",
        "lat": 50.437157492563195,
        "lng": 30.45095936306477,
        "techType": "PLANNED"
    },
    {
        "id": 4,
        "street": "Амосова Миколи",
        "house": "1",
        "lat": 50.41537606565903,
        "lng": 30.457777379604522,
        "techType": "PLANNED"
    },
    {
        "id": 5,
        "street": "Амосова Миколи",
        "house": "2",
        "lat": 50.42375295950134,
        "lng": 30.463121829652376,
        "techType": "GPON"
    },
    {
        "id": 6,
        "street": "Амосова Миколи",
        "house": "4",
        "lat": 50.43705026166502,
        "lng": 30.444999558646465,
        "techType": "PLANNED"
    },
    {
        "id": 7,
        "street": "Барки Василя",
        "house": "5",
        "lat": 50.409912661316675,
        "lng": 30.4825881537001,
        "techType": "GPON"
    },
    {
        "id": 8,
        "street": "Білгородська",
        "house": "14",
        "lat": 50.44108859742683,
        "lng": 30.48285928636399,
        "techType": "GPON"
    },
    {
        "id": 9,
        "street": "Брожків Яр",
        "house": "4/6",
        "lat": 50.427297686348865,
        "lng": 30.447740160142683,
        "techType": "XGS-PON"
    },
    {
        "id": 10,
        "street": "Вузівська",
        "house": "4",
        "lat": 50.4175940853226,
        "lng": 30.465852680340745,
        "techType": "GPON"
    },
    {
        "id": 11,
        "street": "Вузівська",
        "house": "4а",
        "lat": 50.420768981600766,
        "lng": 30.448976879296875,
        "techType": "XGS-PON"
    },
    {
        "id": 12,
        "street": "Гаріна Бориса",
        "house": "25",
        "lat": 50.41293689786639,
        "lng": 30.468315806378893,
        "techType": "GPON"
    },
    {
        "id": 13,
        "street": "Гаріна Бориса",
        "house": "28",
        "lat": 50.415613938073115,
        "lng": 30.466586564007056,
        "techType": "XGS-PON"
    },
    {
        "id": 14,
        "street": "Гаріна Бориса",
        "house": "33",
        "lat": 50.41150194412405,
        "lng": 30.458513691034256,
        "techType": "GPON"
    },
    {
        "id": 15,
        "street": "Гаріна Бориса",
        "house": "37",
        "lat": 50.414822405019166,
        "lng": 30.44524150791436,
        "techType": "XGS-PON"
    },
    {
        "id": 16,
        "street": "Гаріна Бориса",
        "house": "38",
        "lat": 50.43326040623891,
        "lng": 30.48168984987825,
        "techType": "XGS-PON"
    },
    {
        "id": 17,
        "street": "Гаріна Бориса",
        "house": "44",
        "lat": 50.4444507875806,
        "lng": 30.475426346711995,
        "techType": "XGS-PON"
    },
    {
        "id": 18,
        "street": "Гаріна Бориса",
        "house": "46",
        "lat": 50.443316005929795,
        "lng": 30.44894719621605,
        "techType": "GPON"
    },
    {
        "id": 19,
        "street": "Гаріна Бориса",
        "house": "50",
        "lat": 50.441708398996745,
        "lng": 30.460864493338313,
        "techType": "PLANNED"
    },
    {
        "id": 20,
        "street": "Гаріна Бориса",
        "house": "51",
        "lat": 50.40941372575288,
        "lng": 30.473362390048237,
        "techType": "GPON"
    },
    {
        "id": 21,
        "street": "Гаріна Бориса",
        "house": "52",
        "lat": 50.437700526974105,
        "lng": 30.46411253775285,
        "techType": "GPON"
    },
    {
        "id": 22,
        "street": "Гаріна Бориса",
        "house": "53",
        "lat": 50.41952265467666,
        "lng": 30.456289804424205,
        "techType": "PLANNED"
    },
    {
        "id": 23,
        "street": "Гаріна Бориса",
        "house": "68а",
        "lat": 50.433761324391405,
        "lng": 30.464122023427265,
        "techType": "XGS-PON"
    },
    {
        "id": 24,
        "street": "Головка Андрія",
        "house": "1",
        "lat": 50.4135601880104,
        "lng": 30.4619198344817,
        "techType": "XGS-PON"
    },
    {
        "id": 25,
        "street": "Головка Андрія",
        "house": "12",
        "lat": 50.41360768859226,
        "lng": 30.443394853082953,
        "techType": "GPON"
    },
    {
        "id": 26,
        "street": "Головка Андрія",
        "house": "13/1",
        "lat": 50.44137854020476,
        "lng": 30.47265794688022,
        "techType": "GPON"
    },
    {
        "id": 27,
        "street": "Головка Андрія",
        "house": "25",
        "lat": 50.41360381605257,
        "lng": 30.470064875145713,
        "techType": "GPON"
    },
    {
        "id": 28,
        "street": "Головка Андрія",
        "house": "29",
        "lat": 50.426299396936926,
        "lng": 30.450152774575727,
        "techType": "PLANNED"
    },
    {
        "id": 29,
        "street": "Головка Андрія",
        "house": "4",
        "lat": 50.42031492941362,
        "lng": 30.466548343771006,
        "techType": "XGS-PON"
    },
    {
        "id": 30,
        "street": "Головка Андрія",
        "house": "6",
        "lat": 50.42468903791925,
        "lng": 30.461696746384327,
        "techType": "PLANNED"
    },
    {
        "id": 31,
        "street": "Городня",
        "house": "13",
        "lat": 50.42747937127593,
        "lng": 30.45580946131886,
        "techType": "GPON"
    },
    {
        "id": 32,
        "street": "Городня",
        "house": "32",
        "lat": 50.432300334359745,
        "lng": 30.477923331024346,
        "techType": "GPON"
    },
    {
        "id": 33,
        "street": "Городня",
        "house": "38",
        "lat": 50.445693675524254,
        "lng": 30.464436888759643,
        "techType": "GPON"
    },
    {
        "id": 34,
        "street": "Городня",
        "house": "40",
        "lat": 50.44592708345501,
        "lng": 30.4824091003311,
        "techType": "GPON"
    },
    {
        "id": 35,
        "street": "Городня",
        "house": "7",
        "lat": 50.422701654426824,
        "lng": 30.455811685352288,
        "techType": "XGS-PON"
    },
    {
        "id": 36,
        "street": "Григорія Кочура",
        "house": "16",
        "lat": 50.43183884891725,
        "lng": 30.470869556922796,
        "techType": "XGS-PON"
    },
    {
        "id": 37,
        "street": "Григорія Кочура",
        "house": "16а",
        "lat": 50.42732608799509,
        "lng": 30.464194017224276,
        "techType": "XGS-PON"
    },
    {
        "id": 38,
        "street": "Григорія Кочура",
        "house": "18",
        "lat": 50.43427862644456,
        "lng": 30.482001626087964,
        "techType": "GPON"
    },
    {
        "id": 39,
        "street": "Григорія Кочура",
        "house": "19",
        "lat": 50.43863272368852,
        "lng": 30.459530168403465,
        "techType": "PLANNED"
    },
    {
        "id": 40,
        "street": "Григорія Кочура",
        "house": "19/2",
        "lat": 50.41913708965351,
        "lng": 30.4442437497227,
        "techType": "GPON"
    },
    {
        "id": 41,
        "street": "Григорія Кочура",
        "house": "19/6",
        "lat": 50.43685563472379,
        "lng": 30.470944947604174,
        "techType": "XGS-PON"
    },
    {
        "id": 42,
        "street": "Григорія Кочура",
        "house": "3",
        "lat": 50.430524254879074,
        "lng": 30.476596747491733,
        "techType": "PLANNED"
    },
    {
        "id": 43,
        "street": "Григорія Кочура",
        "house": "4",
        "lat": 50.43511700346506,
        "lng": 30.45813136685717,
        "techType": "GPON"
    },
    {
        "id": 44,
        "street": "Григорія Кочура",
        "house": "6",
        "lat": 50.41315072126921,
        "lng": 30.45491203372171,
        "techType": "GPON"
    },
    {
        "id": 45,
        "street": "Григорія Кочура",
        "house": "8",
        "lat": 50.438900722572235,
        "lng": 30.482809280717753,
        "techType": "XGS-PON"
    },
    {
        "id": 46,
        "street": "Громової Уляни",
        "house": "14",
        "lat": 50.42454277278562,
        "lng": 30.476213468376777,
        "techType": "XGS-PON"
    },
    {
        "id": 47,
        "street": "Докучаєвська",
        "house": "11",
        "lat": 50.41987111810837,
        "lng": 30.452349393499432,
        "techType": "GPON"
    },
    {
        "id": 48,
        "street": "Докучаєвська",
        "house": "16",
        "lat": 50.43908896644479,
        "lng": 30.449700940655664,
        "techType": "GPON"
    },
    {
        "id": 49,
        "street": "Докучаєвська",
        "house": "18а",
        "lat": 50.409057119949615,
        "lng": 30.477995554320618,
        "techType": "GPON"
    },
    {
        "id": 50,
        "street": "Донська",
        "house": "10",
        "lat": 50.42519801932529,
        "lng": 30.446663285498765,
        "techType": "XGS-PON"
    },
    {
        "id": 51,
        "street": "Донська",
        "house": "11",
        "lat": 50.4128478540292,
        "lng": 30.4682923846176,
        "techType": "XGS-PON"
    },
    {
        "id": 52,
        "street": "Донська",
        "house": "12",
        "lat": 50.43029076173271,
        "lng": 30.47940492293238,
        "techType": "XGS-PON"
    },
    {
        "id": 53,
        "street": "Донська",
        "house": "14",
        "lat": 50.40934988857672,
        "lng": 30.45782094689133,
        "techType": "GPON"
    },
    {
        "id": 54,
        "street": "Донська",
        "house": "15",
        "lat": 50.437880883078826,
        "lng": 30.45905535811374,
        "techType": "GPON"
    },
    {
        "id": 55,
        "street": "Донська",
        "house": "16",
        "lat": 50.40919267990551,
        "lng": 30.449628090038335,
        "techType": "GPON"
    },
    {
        "id": 56,
        "street": "Донська",
        "house": "18",
        "lat": 50.417613923296315,
        "lng": 30.444950908132324,
        "techType": "GPON"
    },
    {
        "id": 57,
        "street": "Донська",
        "house": "2/58",
        "lat": 50.424317191781626,
        "lng": 30.45802564527221,
        "techType": "GPON"
    },
    {
        "id": 58,
        "street": "Донська",
        "house": "24",
        "lat": 50.430740689647095,
        "lng": 30.44406636927291,
        "techType": "GPON"
    },
    {
        "id": 59,
        "street": "Донська",
        "house": "26",
        "lat": 50.427672247805624,
        "lng": 30.446327897949697,
        "techType": "PLANNED"
    },
    {
        "id": 60,
        "street": "Донська",
        "house": "28",
        "lat": 50.440385679849996,
        "lng": 30.47789211793671,
        "techType": "GPON"
    },
    {
        "id": 61,
        "street": "Донська",
        "house": "30",
        "lat": 50.41618234673887,
        "lng": 30.455377464317998,
        "techType": "XGS-PON"
    },
    {
        "id": 62,
        "street": "Донська",
        "house": "34",
        "lat": 50.41326027526908,
        "lng": 30.48230858785991,
        "techType": "XGS-PON"
    },
    {
        "id": 63,
        "street": "Донська",
        "house": "4",
        "lat": 50.428028140634794,
        "lng": 30.45586984696648,
        "techType": "GPON"
    },
    {
        "id": 64,
        "street": "Донська",
        "house": "5а",
        "lat": 50.44577291791494,
        "lng": 30.47460385067082,
        "techType": "PLANNED"
    },
    {
        "id": 65,
        "street": "Донська",
        "house": "6",
        "lat": 50.43720696648157,
        "lng": 30.447960747470795,
        "techType": "PLANNED"
    },
    {
        "id": 66,
        "street": "Донська",
        "house": "8",
        "lat": 50.43430260730595,
        "lng": 30.447148425736465,
        "techType": "XGS-PON"
    },
    {
        "id": 67,
        "street": "Донська",
        "house": "8а",
        "lat": 50.41346433710213,
        "lng": 30.44997057713887,
        "techType": "XGS-PON"
    },
    {
        "id": 68,
        "street": "Донська",
        "house": "9",
        "lat": 50.41166662259863,
        "lng": 30.479237330832863,
        "techType": "GPON"
    },
    {
        "id": 69,
        "street": "Ернста Федора",
        "house": "12",
        "lat": 50.419654916931655,
        "lng": 30.45709245140966,
        "techType": "GPON"
    },
    {
        "id": 70,
        "street": "Ернста Федора",
        "house": "2",
        "lat": 50.44163069366793,
        "lng": 30.456463363908362,
        "techType": "PLANNED"
    },
    {
        "id": 71,
        "street": "Ернста Федора",
        "house": "6",
        "lat": 50.44414233763721,
        "lng": 30.453999516794504,
        "techType": "PLANNED"
    },
    {
        "id": 72,
        "street": "Жмеринська",
        "house": "2",
        "lat": 50.42997615811098,
        "lng": 30.461354547429874,
        "techType": "XGS-PON"
    },
    {
        "id": 73,
        "street": "Здолбунівська",
        "house": "16",
        "lat": 50.42130254746793,
        "lng": 30.44903773095057,
        "techType": "XGS-PON"
    },
    {
        "id": 74,
        "street": "Зерових Братів",
        "house": "14_1",
        "lat": 50.43618057923122,
        "lng": 30.481970841749447,
        "techType": "XGS-PON"
    },
    {
        "id": 75,
        "street": "Зерових Братів",
        "house": "14_2",
        "lat": 50.43147164810415,
        "lng": 30.462220038403483,
        "techType": "XGS-PON"
    },
    {
        "id": 76,
        "street": "Зерових Братів",
        "house": "14_3",
        "lat": 50.41270261201022,
        "lng": 30.47441129154697,
        "techType": "XGS-PON"
    },
    {
        "id": 77,
        "street": "Зерових Братів",
        "house": "14/18",
        "lat": 50.410501104983965,
        "lng": 30.471104307914526,
        "techType": "GPON"
    },
    {
        "id": 78,
        "street": "Зерових Братів",
        "house": "14а",
        "lat": 50.432613346691184,
        "lng": 30.472609514523405,
        "techType": "GPON"
    },
    {
        "id": 79,
        "street": "Зерових Братів",
        "house": "19",
        "lat": 50.42280929646048,
        "lng": 30.44703994801194,
        "techType": "GPON"
    },
    {
        "id": 80,
        "street": "Зерових Братів",
        "house": "21",
        "lat": 50.415681106267265,
        "lng": 30.47732873648999,
        "techType": "XGS-PON"
    },
    {
        "id": 81,
        "street": "Зерових Братів",
        "house": "23",
        "lat": 50.415696124039556,
        "lng": 30.451326214082016,
        "techType": "XGS-PON"
    },
    {
        "id": 82,
        "street": "Зерових Братів",
        "house": "25",
        "lat": 50.4173487770533,
        "lng": 30.453458844018293,
        "techType": "GPON"
    },
    {
        "id": 83,
        "street": "Златопільська",
        "house": "3",
        "lat": 50.424508308195875,
        "lng": 30.47316806411964,
        "techType": "GPON"
    },
    {
        "id": 84,
        "street": "Златопільська",
        "house": "4к",
        "lat": 50.431149176400496,
        "lng": 30.47422963009607,
        "techType": "XGS-PON"
    },
    {
        "id": 85,
        "street": "Кавказька",
        "house": "11",
        "lat": 50.41768444701388,
        "lng": 30.475977949034547,
        "techType": "GPON"
    },
    {
        "id": 86,
        "street": "Кавказька",
        "house": "13",
        "lat": 50.44219176007817,
        "lng": 30.45181673024633,
        "techType": "GPON"
    },
    {
        "id": 87,
        "street": "Кавказька",
        "house": "7",
        "lat": 50.43225974896387,
        "lng": 30.453515685666297,
        "techType": "XGS-PON"
    },
    {
        "id": 88,
        "street": "Кавказька",
        "house": "9",
        "lat": 50.42745891405059,
        "lng": 30.463554564785163,
        "techType": "XGS-PON"
    },
    {
        "id": 89,
        "street": "Кадетський Гай",
        "house": "11",
        "lat": 50.42713311645989,
        "lng": 30.45812425202372,
        "techType": "XGS-PON"
    },
    {
        "id": 90,
        "street": "Кадетський Гай",
        "house": "3",
        "lat": 50.43319233778072,
        "lng": 30.478495514176046,
        "techType": "XGS-PON"
    },
    {
        "id": 91,
        "street": "Кадетський Гай",
        "house": "6а",
        "lat": 50.44456835326228,
        "lng": 30.447572363995807,
        "techType": "XGS-PON"
    },
    {
        "id": 92,
        "street": "Кадетський Гай",
        "house": "7",
        "lat": 50.43146105920428,
        "lng": 30.470732046853197,
        "techType": "GPON"
    },
    {
        "id": 93,
        "street": "Кадетський Гай",
        "house": "9",
        "lat": 50.412988958827384,
        "lng": 30.453327945710374,
        "techType": "XGS-PON"
    },
    {
        "id": 94,
        "street": "Кишинівська",
        "house": "15",
        "lat": 50.4084083428067,
        "lng": 30.45478588880681,
        "techType": "XGS-PON"
    },
    {
        "id": 95,
        "street": "Кишинівська",
        "house": "24а",
        "lat": 50.425114945507865,
        "lng": 30.480377754175386,
        "techType": "XGS-PON"
    },
    {
        "id": 96,
        "street": "Кільцева дорога",
        "house": "22/4",
        "lat": 50.429468378383724,
        "lng": 30.44699145355979,
        "techType": "XGS-PON"
    },
    {
        "id": 97,
        "street": "Клінічна",
        "house": "12",
        "lat": 50.42963304827204,
        "lng": 30.45572129088496,
        "techType": "XGS-PON"
    },
    {
        "id": 98,
        "street": "Клінічна",
        "house": "17",
        "lat": 50.441822097442994,
        "lng": 30.454246405897695,
        "techType": "PLANNED"
    },
    {
        "id": 99,
        "street": "Клінічна",
        "house": "21/19",
        "lat": 50.43280631550566,
        "lng": 30.457359544359765,
        "techType": "XGS-PON"
    },
    {
        "id": 100,
        "street": "Клінічна",
        "house": "23/25",
        "lat": 50.443380388237905,
        "lng": 30.473651378416324,
        "techType": "GPON"
    },
    {
        "id": 101,
        "street": "Клінічна",
        "house": "40/4",
        "lat": 50.42258438065202,
        "lng": 30.453514155196796,
        "techType": "XGS-PON"
    },
    {
        "id": 102,
        "street": "Космодем'янської Зої",
        "house": "22",
        "lat": 50.43570296519356,
        "lng": 30.448026433470577,
        "techType": "GPON"
    },
    {
        "id": 103,
        "street": "Кривоноса Максима",
        "house": "15",
        "lat": 50.410173832141666,
        "lng": 30.482232788784945,
        "techType": "GPON"
    },
    {
        "id": 104,
        "street": "Кривоноса Максима",
        "house": "17",
        "lat": 50.41126935092813,
        "lng": 30.46342351087986,
        "techType": "XGS-PON"
    },
    {
        "id": 105,
        "street": "Кривоноса Максима",
        "house": "29",
        "lat": 50.42972068916284,
        "lng": 30.444708776959757,
        "techType": "XGS-PON"
    },
    {
        "id": 106,
        "street": "Кудряшова",
        "house": "12/14",
        "lat": 50.44560840957134,
        "lng": 30.467026827828914,
        "techType": "XGS-PON"
    },
    {
        "id": 107,
        "street": "Кудряшова",
        "house": "16",
        "lat": 50.41004165488684,
        "lng": 30.45577339734622,
        "techType": "XGS-PON"
    },
    {
        "id": 108,
        "street": "Кудряшова",
        "house": "18",
        "lat": 50.442279392840256,
        "lng": 30.475500651507335,
        "techType": "XGS-PON"
    },
    {
        "id": 109,
        "street": "Кудряшова",
        "house": "2",
        "lat": 50.42999455454039,
        "lng": 30.46109297135113,
        "techType": "GPON"
    },
    {
        "id": 110,
        "street": "Кудряшова",
        "house": "20",
        "lat": 50.43951524275871,
        "lng": 30.482994117066728,
        "techType": "XGS-PON"
    },
    {
        "id": 111,
        "street": "Кудряшова",
        "house": "20б",
        "lat": 50.4452944382953,
        "lng": 30.459336343471726,
        "techType": "PLANNED"
    },
    {
        "id": 112,
        "street": "Кудряшова",
        "house": "20г",
        "lat": 50.42855250275693,
        "lng": 30.446100986506025,
        "techType": "XGS-PON"
    },
    {
        "id": 113,
        "street": "Кудряшова",
        "house": "22",
        "lat": 50.44353371421411,
        "lng": 30.464062140107185,
        "techType": "GPON"
    },
    {
        "id": 114,
        "street": "Кудряшова",
        "house": "3",
        "lat": 50.43489055804328,
        "lng": 30.478931966256237,
        "techType": "GPON"
    },
    {
        "id": 115,
        "street": "Кудряшова",
        "house": "4",
        "lat": 50.41715822137782,
        "lng": 30.46955261446777,
        "techType": "PLANNED"
    },
    {
        "id": 116,
        "street": "Кудряшова",
        "house": "5",
        "lat": 50.41307882873355,
        "lng": 30.463885595547335,
        "techType": "GPON"
    },
    {
        "id": 117,
        "street": "Кудряшова",
        "house": "5а",
        "lat": 50.43609412093791,
        "lng": 30.447599313537456,
        "techType": "XGS-PON"
    },
    {
        "id": 118,
        "street": "Кудряшова",
        "house": "6",
        "lat": 50.4225261826485,
        "lng": 30.48155539570582,
        "techType": "XGS-PON"
    },
    {
        "id": 119,
        "street": "Кудряшова",
        "house": "7",
        "lat": 50.42307173985198,
        "lng": 30.469107604439937,
        "techType": "XGS-PON"
    },
    {
        "id": 120,
        "street": "Кудряшова",
        "house": "77",
        "lat": 50.438528638194704,
        "lng": 30.47280717617225,
        "techType": "PLANNED"
    },
    {
        "id": 121,
        "street": "Кудряшова",
        "house": "7б",
        "lat": 50.438765241636446,
        "lng": 30.47612227971793,
        "techType": "PLANNED"
    },
    {
        "id": 122,
        "street": "Кучмин Яр",
        "house": "15б",
        "lat": 50.43675782068164,
        "lng": 30.47907134066357,
        "techType": "GPON"
    },
    {
        "id": 123,
        "street": "Кучмин Яр",
        "house": "58",
        "lat": 50.438556448731134,
        "lng": 30.45074411598602,
        "techType": "XGS-PON"
    },
    {
        "id": 124,
        "street": "Липківського Василя",
        "house": "11",
        "lat": 50.407677140195894,
        "lng": 30.473981533123546,
        "techType": "XGS-PON"
    },
    {
        "id": 125,
        "street": "Липківського Василя",
        "house": "13",
        "lat": 50.408517931801654,
        "lng": 30.450333114767712,
        "techType": "XGS-PON"
    },
    {
        "id": 126,
        "street": "Липківського Василя",
        "house": "15",
        "lat": 50.425390220178215,
        "lng": 30.459009529015468,
        "techType": "GPON"
    },
    {
        "id": 127,
        "street": "Липківського Василя",
        "house": "17",
        "lat": 50.44007661623672,
        "lng": 30.45208641409153,
        "techType": "PLANNED"
    },
    {
        "id": 128,
        "street": "Липківського Василя",
        "house": "19",
        "lat": 50.41616457797478,
        "lng": 30.444839148516486,
        "techType": "PLANNED"
    },
    {
        "id": 129,
        "street": "Липківського Василя",
        "house": "21",
        "lat": 50.43144675891206,
        "lng": 30.475649216359532,
        "techType": "GPON"
    },
    {
        "id": 130,
        "street": "Липківського Василя",
        "house": "23",
        "lat": 50.41267294399487,
        "lng": 30.475916415928317,
        "techType": "XGS-PON"
    },
    {
        "id": 131,
        "street": "Липківського Василя",
        "house": "24",
        "lat": 50.41224475275581,
        "lng": 30.478307308901574,
        "techType": "GPON"
    },
    {
        "id": 132,
        "street": "Липківського Василя",
        "house": "25",
        "lat": 50.42618718011741,
        "lng": 30.45930399218561,
        "techType": "XGS-PON"
    },
    {
        "id": 133,
        "street": "Липківського Василя",
        "house": "27/5",
        "lat": 50.42692605324948,
        "lng": 30.467843081165093,
        "techType": "PLANNED"
    },
    {
        "id": 134,
        "street": "Липківського Василя",
        "house": "3",
        "lat": 50.41336839722263,
        "lng": 30.4437076567966,
        "techType": "GPON"
    },
    {
        "id": 135,
        "street": "Липківського Василя",
        "house": "34",
        "lat": 50.44099160602939,
        "lng": 30.469747671154785,
        "techType": "PLANNED"
    },
    {
        "id": 136,
        "street": "Липківського Василя",
        "house": "37а",
        "lat": 50.411834555639835,
        "lng": 30.444924077633225,
        "techType": "GPON"
    },
    {
        "id": 137,
        "street": "Липківського Василя",
        "house": "40",
        "lat": 50.42930990153309,
        "lng": 30.44583555337901,
        "techType": "GPON"
    },
    {
        "id": 138,
        "street": "Липківського Василя",
        "house": "45",
        "lat": 50.432250262230134,
        "lng": 30.456184903671897,
        "techType": "GPON"
    },
    {
        "id": 139,
        "street": "Липківського Василя",
        "house": "5",
        "lat": 50.4426117130357,
        "lng": 30.480605181689224,
        "techType": "GPON"
    },
    {
        "id": 140,
        "street": "Липківського Василя",
        "house": "7",
        "lat": 50.41127439188205,
        "lng": 30.458440271228746,
        "techType": "GPON"
    },
    {
        "id": 141,
        "street": "Липківського Василя",
        "house": "9",
        "lat": 50.417946904616855,
        "lng": 30.48250194383935,
        "techType": "GPON"
    },
    {
        "id": 142,
        "street": "Лобановського Валерія проспект",
        "house": "12",
        "lat": 50.42362571678677,
        "lng": 30.46430355808559,
        "techType": "XGS-PON"
    },
    {
        "id": 143,
        "street": "Лобановського Валерія проспект",
        "house": "18",
        "lat": 50.4241752735589,
        "lng": 30.47365314924349,
        "techType": "XGS-PON"
    },
    {
        "id": 144,
        "street": "Лобановського Валерія проспект",
        "house": "27",
        "lat": 50.40735199291139,
        "lng": 30.463132684426625,
        "techType": "GPON"
    },
    {
        "id": 145,
        "street": "Лобановського Валерія проспект",
        "house": "29",
        "lat": 50.41900615948493,
        "lng": 30.46556812028774,
        "techType": "PLANNED"
    },
    {
        "id": 146,
        "street": "Лобановського Валерія проспект",
        "house": "31",
        "lat": 50.42541115677606,
        "lng": 30.473109270925715,
        "techType": "GPON"
    },
    {
        "id": 147,
        "street": "Лобановського Валерія проспект",
        "house": "33",
        "lat": 50.44537710041273,
        "lng": 30.462013022069417,
        "techType": "GPON"
    },
    {
        "id": 148,
        "street": "Лобановського Валерія проспект",
        "house": "35",
        "lat": 50.43313774803467,
        "lng": 30.472799861655496,
        "techType": "XGS-PON"
    },
    {
        "id": 149,
        "street": "Лобановського Валерія проспект",
        "house": "37",
        "lat": 50.42215717204077,
        "lng": 30.480322870322052,
        "techType": "XGS-PON"
    },
    {
        "id": 150,
        "street": "Лобановського Валерія проспект",
        "house": "39_1",
        "lat": 50.420606025227876,
        "lng": 30.469699806904206,
        "techType": "GPON"
    },
    {
        "id": 151,
        "street": "Лобановського Валерія проспект",
        "house": "39_2",
        "lat": 50.42782625888617,
        "lng": 30.46300433449665,
        "techType": "XGS-PON"
    },
    {
        "id": 152,
        "street": "Лобановського Валерія проспект",
        "house": "39б",
        "lat": 50.430285012890934,
        "lng": 30.452377687119707,
        "techType": "GPON"
    },
    {
        "id": 153,
        "street": "Лобановського Валерія проспект",
        "house": "4_1",
        "lat": 50.40849560920898,
        "lng": 30.4822790646538,
        "techType": "GPON"
    },
    {
        "id": 154,
        "street": "Лобановського Валерія проспект",
        "house": "41",
        "lat": 50.43954576194066,
        "lng": 30.4763476127916,
        "techType": "PLANNED"
    },
    {
        "id": 155,
        "street": "Лобановського Валерія проспект",
        "house": "4а",
        "lat": 50.43544314054714,
        "lng": 30.454548035846987,
        "techType": "GPON"
    },
    {
        "id": 156,
        "street": "Лобановського Валерія проспект",
        "house": "4б",
        "lat": 50.442574885568284,
        "lng": 30.464703546790812,
        "techType": "XGS-PON"
    },
    {
        "id": 157,
        "street": "Лобановського Валерія проспект",
        "house": "4в",
        "lat": 50.42008045930388,
        "lng": 30.465872501406707,
        "techType": "GPON"
    },
    {
        "id": 158,
        "street": "Лобановського Валерія проспект",
        "house": "4г",
        "lat": 50.41708394183268,
        "lng": 30.45259977807443,
        "techType": "PLANNED"
    },
    {
        "id": 159,
        "street": "Лобановського Валерія проспект",
        "house": "4ж",
        "lat": 50.42885086104172,
        "lng": 30.465499244474945,
        "techType": "GPON"
    },
    {
        "id": 160,
        "street": "Лобановського Валерія проспект",
        "house": "53",
        "lat": 50.43173784423375,
        "lng": 30.450767237353038,
        "techType": "XGS-PON"
    },
    {
        "id": 161,
        "street": "Лобановського Валерія проспект",
        "house": "55",
        "lat": 50.41391357491709,
        "lng": 30.463824363296595,
        "techType": "GPON"
    },
    {
        "id": 162,
        "street": "Лобановського Валерія проспект",
        "house": "57",
        "lat": 50.410219363303206,
        "lng": 30.47584910632667,
        "techType": "XGS-PON"
    },
    {
        "id": 163,
        "street": "Лобановського Валерія проспект",
        "house": "58/2",
        "lat": 50.41061514227108,
        "lng": 30.45891640891781,
        "techType": "XGS-PON"
    },
    {
        "id": 164,
        "street": "Лобановського Валерія проспект",
        "house": "59",
        "lat": 50.43420443796852,
        "lng": 30.45790642578713,
        "techType": "XGS-PON"
    },
    {
        "id": 165,
        "street": "Лобановського Валерія проспект",
        "house": "5а",
        "lat": 50.417225283825026,
        "lng": 30.46887110764091,
        "techType": "XGS-PON"
    },
    {
        "id": 166,
        "street": "Лобановського Валерія проспект",
        "house": "60",
        "lat": 50.43170995817593,
        "lng": 30.444559769202073,
        "techType": "XGS-PON"
    },
    {
        "id": 167,
        "street": "Лобановського Валерія проспект",
        "house": "64",
        "lat": 50.42375533684126,
        "lng": 30.460319763259605,
        "techType": "XGS-PON"
    },
    {
        "id": 168,
        "street": "Лобановського Валерія проспект",
        "house": "68",
        "lat": 50.42586832951264,
        "lng": 30.47386478365555,
        "techType": "XGS-PON"
    },
    {
        "id": 169,
        "street": "Лобановського Валерія проспект",
        "house": "68/2",
        "lat": 50.44083470390018,
        "lng": 30.443351248228673,
        "techType": "GPON"
    },
    {
        "id": 170,
        "street": "Лобановського Валерія проспект",
        "house": "6а",
        "lat": 50.444519200869465,
        "lng": 30.468823400071845,
        "techType": "GPON"
    },
    {
        "id": 171,
        "street": "Лобановського Валерія проспект",
        "house": "6в",
        "lat": 50.41261497473184,
        "lng": 30.450849589669062,
        "techType": "XGS-PON"
    },
    {
        "id": 172,
        "street": "Лобановського Валерія проспект",
        "house": "6д",
        "lat": 50.42234411030643,
        "lng": 30.47715098777037,
        "techType": "XGS-PON"
    },
    {
        "id": 173,
        "street": "Лобановського Валерія проспект",
        "house": "70",
        "lat": 50.42757364296674,
        "lng": 30.46458702847802,
        "techType": "XGS-PON"
    },
    {
        "id": 174,
        "street": "Лобановського Валерія проспект",
        "house": "9/1",
        "lat": 50.42074598489569,
        "lng": 30.477986392687058,
        "techType": "XGS-PON"
    },
    {
        "id": 175,
        "street": "Можайська",
        "house": "10",
        "lat": 50.4362676478399,
        "lng": 30.463662193133676,
        "techType": "XGS-PON"
    },
    {
        "id": 176,
        "street": "Неходи Івана",
        "house": "10",
        "lat": 50.43347688812531,
        "lng": 30.4451976972141,
        "techType": "XGS-PON"
    },
    {
        "id": 177,
        "street": "Неходи Івана",
        "house": "3",
        "lat": 50.430913287982996,
        "lng": 30.46831833078132,
        "techType": "GPON"
    },
    {
        "id": 178,
        "street": "Неходи Івана",
        "house": "5",
        "lat": 50.426726568996735,
        "lng": 30.474079879438325,
        "techType": "XGS-PON"
    },
    {
        "id": 179,
        "street": "Неходи Івана",
        "house": "7",
        "lat": 50.41152491302664,
        "lng": 30.469416007570466,
        "techType": "XGS-PON"
    },
    {
        "id": 180,
        "street": "Неходи Івана",
        "house": "8",
        "lat": 50.41847894950501,
        "lng": 30.454837085259047,
        "techType": "XGS-PON"
    },
    {
        "id": 181,
        "street": "Нововокзальна",
        "house": "19",
        "lat": 50.4234969768346,
        "lng": 30.452117439466488,
        "techType": "GPON"
    },
    {
        "id": 182,
        "street": "Нововокзальна",
        "house": "21",
        "lat": 50.445488020121836,
        "lng": 30.47151596091657,
        "techType": "PLANNED"
    },
    {
        "id": 183,
        "street": "Нововокзальна",
        "house": "53",
        "lat": 50.44526885748626,
        "lng": 30.456522056992814,
        "techType": "XGS-PON"
    },
    {
        "id": 184,
        "street": "Нововокзальна",
        "house": "8",
        "lat": 50.41918660079978,
        "lng": 30.447032658723934,
        "techType": "PLANNED"
    },
    {
        "id": 185,
        "street": "Озерна",
        "house": "12а",
        "lat": 50.44065863100334,
        "lng": 30.459286219949362,
        "techType": "PLANNED"
    },
    {
        "id": 186,
        "street": "Озерна",
        "house": "7",
        "lat": 50.43250686630072,
        "lng": 30.44577946388031,
        "techType": "PLANNED"
    },
    {
        "id": 187,
        "street": "Озерна",
        "house": "9",
        "lat": 50.44101255865888,
        "lng": 30.459448525714254,
        "techType": "GPON"
    },
    {
        "id": 188,
        "street": "Олексіївська",
        "house": "11",
        "lat": 50.4213598037319,
        "lng": 30.476065955939042,
        "techType": "GPON"
    },
    {
        "id": 189,
        "street": "Олексіївська",
        "house": "3",
        "lat": 50.41318483484434,
        "lng": 30.464306370451283,
        "techType": "XGS-PON"
    },
    {
        "id": 190,
        "street": "Олексіївська",
        "house": "3а",
        "lat": 50.437039456865904,
        "lng": 30.476932345734703,
        "techType": "GPON"
    },
    {
        "id": 191,
        "street": "Олексіївська",
        "house": "5",
        "lat": 50.41308993835626,
        "lng": 30.44707441381223,
        "techType": "GPON"
    },
    {
        "id": 192,
        "street": "Освіти",
        "house": "14а",
        "lat": 50.41341520078685,
        "lng": 30.444863928824248,
        "techType": "XGS-PON"
    },
    {
        "id": 193,
        "street": "Освіти",
        "house": "3а",
        "lat": 50.443769765783095,
        "lng": 30.452685542088254,
        "techType": "GPON"
    },
    {
        "id": 194,
        "street": "провулок Народний",
        "house": "18",
        "lat": 50.444444619136156,
        "lng": 30.45993983439003,
        "techType": "XGS-PON"
    },
    {
        "id": 195,
        "street": "провулок Народний",
        "house": "2",
        "lat": 50.42742671271761,
        "lng": 30.459365696226655,
        "techType": "XGS-PON"
    },
    {
        "id": 196,
        "street": "Повітрофлотський проспект",
        "house": "10",
        "lat": 50.4383343530265,
        "lng": 30.450772176537424,
        "techType": "PLANNED"
    },
    {
        "id": 197,
        "street": "Повітрофлотський проспект",
        "house": "19",
        "lat": 50.42087394435977,
        "lng": 30.45350449614403,
        "techType": "GPON"
    },
    {
        "id": 198,
        "street": "Преображенська",
        "house": "10/17",
        "lat": 50.416377966493464,
        "lng": 30.454422707098338,
        "techType": "GPON"
    },
    {
        "id": 199,
        "street": "Преображенська",
        "house": "14",
        "lat": 50.427280309395684,
        "lng": 30.477248646259582,
        "techType": "XGS-PON"
    },
    {
        "id": 200,
        "street": "Преображенська",
        "house": "16",
        "lat": 50.43154584907743,
        "lng": 30.459835699647552,
        "techType": "XGS-PON"
    },
    {
        "id": 201,
        "street": "Преображенська",
        "house": "19/2",
        "lat": 50.43995495556409,
        "lng": 30.451789637038946,
        "techType": "XGS-PON"
    },
    {
        "id": 202,
        "street": "Преображенська",
        "house": "21",
        "lat": 50.43435777009488,
        "lng": 30.4791161974112,
        "techType": "XGS-PON"
    },
    {
        "id": 203,
        "street": "Преображенська",
        "house": "22/9",
        "lat": 50.43547400395061,
        "lng": 30.44970731701149,
        "techType": "PLANNED"
    },
    {
        "id": 204,
        "street": "Преображенська",
        "house": "25",
        "lat": 50.41291299187185,
        "lng": 30.465978734796963,
        "techType": "GPON"
    },
    {
        "id": 205,
        "street": "Преображенська",
        "house": "26",
        "lat": 50.42270343335657,
        "lng": 30.476838794589643,
        "techType": "XGS-PON"
    },
    {
        "id": 206,
        "street": "Преображенська",
        "house": "27",
        "lat": 50.41064798219946,
        "lng": 30.46668624793417,
        "techType": "GPON"
    },
    {
        "id": 207,
        "street": "Преображенська",
        "house": "28",
        "lat": 50.41452148358932,
        "lng": 30.449484695870453,
        "techType": "GPON"
    },
    {
        "id": 208,
        "street": "Преображенська",
        "house": "37",
        "lat": 50.42519510617371,
        "lng": 30.44834657227526,
        "techType": "XGS-PON"
    },
    {
        "id": 209,
        "street": "Преображенська",
        "house": "40",
        "lat": 50.41402006274477,
        "lng": 30.46896157315153,
        "techType": "XGS-PON"
    },
    {
        "id": 210,
        "street": "Преображенська",
        "house": "8б",
        "lat": 50.424605997637215,
        "lng": 30.478187197335934,
        "techType": "GPON"
    },
    {
        "id": 211,
        "street": "провулок Енергетиків",
        "house": "1",
        "lat": 50.4153980159724,
        "lng": 30.474919749778834,
        "techType": "XGS-PON"
    },
    {
        "id": 212,
        "street": "проспект Академіка Палладіна",
        "house": "23а",
        "lat": 50.43889187337785,
        "lng": 30.47925983073739,
        "techType": "GPON"
    },
    {
        "id": 213,
        "street": "Проценко Людмили",
        "house": "15",
        "lat": 50.433814751281396,
        "lng": 30.45011615968449,
        "techType": "XGS-PON"
    },
    {
        "id": 214,
        "street": "Проценко Людмили",
        "house": "2",
        "lat": 50.43400455690981,
        "lng": 30.482313281480106,
        "techType": "GPON"
    },
    {
        "id": 215,
        "street": "Проценко Людмили",
        "house": "4",
        "lat": 50.41316649091057,
        "lng": 30.450495232773928,
        "techType": "PLANNED"
    },
    {
        "id": 216,
        "street": "Проценко Людмили",
        "house": "6",
        "lat": 50.43734043045332,
        "lng": 30.460639173752217,
        "techType": "PLANNED"
    },
    {
        "id": 217,
        "street": "Проценко Людмили",
        "house": "8",
        "lat": 50.418549102073015,
        "lng": 30.447337040154334,
        "techType": "XGS-PON"
    },
    {
        "id": 218,
        "street": "Пулюя Івана",
        "house": "1",
        "lat": 50.443774769762136,
        "lng": 30.444581165374164,
        "techType": "PLANNED"
    },
    {
        "id": 219,
        "street": "Пулюя Івана",
        "house": "1а",
        "lat": 50.438994798858424,
        "lng": 30.458779966829844,
        "techType": "XGS-PON"
    },
    {
        "id": 220,
        "street": "Пулюя Івана",
        "house": "2",
        "lat": 50.42476029809145,
        "lng": 30.45273639426604,
        "techType": "XGS-PON"
    },
    {
        "id": 221,
        "street": "Пулюя Івана",
        "house": "3",
        "lat": 50.42824407801079,
        "lng": 30.472962881689934,
        "techType": "XGS-PON"
    },
    {
        "id": 222,
        "street": "Пулюя Івана",
        "house": "5а",
        "lat": 50.43265802486718,
        "lng": 30.447539644042507,
        "techType": "XGS-PON"
    },
    {
        "id": 223,
        "street": "Пулюя Івана",
        "house": "5б",
        "lat": 50.408521184565146,
        "lng": 30.481148633696396,
        "techType": "PLANNED"
    },
    {
        "id": 224,
        "street": "Радченка Петра",
        "house": "11",
        "lat": 50.40806011142685,
        "lng": 30.4442684842916,
        "techType": "XGS-PON"
    },
    {
        "id": 225,
        "street": "Радченка Петра",
        "house": "12",
        "lat": 50.43838483663153,
        "lng": 30.46232198604639,
        "techType": "XGS-PON"
    },
    {
        "id": 226,
        "street": "Радченка Петра",
        "house": "14",
        "lat": 50.4089631749086,
        "lng": 30.443526284549183,
        "techType": "XGS-PON"
    },
    {
        "id": 227,
        "street": "Радченка Петра",
        "house": "17",
        "lat": 50.41625733949392,
        "lng": 30.45925586300211,
        "techType": "PLANNED"
    },
    {
        "id": 228,
        "street": "Радченка Петра",
        "house": "21а",
        "lat": 50.44426948187755,
        "lng": 30.476741809457316,
        "techType": "PLANNED"
    },
    {
        "id": 229,
        "street": "Радченка Петра",
        "house": "4",
        "lat": 50.44594750678633,
        "lng": 30.470643038293375,
        "techType": "PLANNED"
    },
    {
        "id": 230,
        "street": "Радченка Петра",
        "house": "6",
        "lat": 50.43724357286973,
        "lng": 30.456288192841406,
        "techType": "XGS-PON"
    },
    {
        "id": 231,
        "street": "Радченка Петра",
        "house": "7",
        "lat": 50.42503321732959,
        "lng": 30.44521287633272,
        "techType": "GPON"
    },
    {
        "id": 232,
        "street": "Радченка Петра",
        "house": "8",
        "lat": 50.43353911008145,
        "lng": 30.471812582083754,
        "techType": "GPON"
    },
    {
        "id": 233,
        "street": "Ратушного Романа",
        "house": "12",
        "lat": 50.43103485257847,
        "lng": 30.464527606280434,
        "techType": "GPON"
    },
    {
        "id": 234,
        "street": "Ратушного Романа",
        "house": "14",
        "lat": 50.43893610976738,
        "lng": 30.470660868892164,
        "techType": "PLANNED"
    },
    {
        "id": 235,
        "street": "Ратушного Романа",
        "house": "16",
        "lat": 50.427831361607396,
        "lng": 30.444019201258556,
        "techType": "PLANNED"
    },
    {
        "id": 236,
        "street": "Ратушного Романа",
        "house": "17",
        "lat": 50.42072362458871,
        "lng": 30.445234631841316,
        "techType": "GPON"
    },
    {
        "id": 237,
        "street": "Ратушного Романа",
        "house": "18",
        "lat": 50.437864041674864,
        "lng": 30.474629605601432,
        "techType": "PLANNED"
    },
    {
        "id": 238,
        "street": "Ратушного Романа",
        "house": "19",
        "lat": 50.40743473531061,
        "lng": 30.449750771430143,
        "techType": "PLANNED"
    },
    {
        "id": 239,
        "street": "Ратушного Романа",
        "house": "2",
        "lat": 50.424493315301824,
        "lng": 30.445789159428482,
        "techType": "GPON"
    },
    {
        "id": 240,
        "street": "Ратушного Романа",
        "house": "2/4",
        "lat": 50.412336047814286,
        "lng": 30.454977096673897,
        "techType": "XGS-PON"
    },
    {
        "id": 241,
        "street": "Ратушного Романа",
        "house": "21",
        "lat": 50.43069505460615,
        "lng": 30.447394776654786,
        "techType": "GPON"
    },
    {
        "id": 242,
        "street": "Ратушного Романа",
        "house": "21а",
        "lat": 50.43790231740583,
        "lng": 30.453946028972968,
        "techType": "PLANNED"
    },
    {
        "id": 243,
        "street": "Ратушного Романа",
        "house": "23",
        "lat": 50.42967170693974,
        "lng": 30.443318984741097,
        "techType": "XGS-PON"
    },
    {
        "id": 244,
        "street": "Ратушного Романа",
        "house": "25а",
        "lat": 50.42453504596408,
        "lng": 30.475428231692586,
        "techType": "GPON"
    },
    {
        "id": 245,
        "street": "Ратушного Романа",
        "house": "27",
        "lat": 50.43098286428227,
        "lng": 30.44795898558037,
        "techType": "GPON"
    },
    {
        "id": 246,
        "street": "Ратушного Романа",
        "house": "29",
        "lat": 50.40980063677063,
        "lng": 30.47890518408864,
        "techType": "GPON"
    },
    {
        "id": 247,
        "street": "Ратушного Романа",
        "house": "29a",
        "lat": 50.43481712054787,
        "lng": 30.44770653992264,
        "techType": "GPON"
    },
    {
        "id": 248,
        "street": "Ратушного Романа",
        "house": "29а",
        "lat": 50.41146539020225,
        "lng": 30.456737593105654,
        "techType": "XGS-PON"
    },
    {
        "id": 249,
        "street": "Ратушного Романа",
        "house": "3",
        "lat": 50.43092839408381,
        "lng": 30.4681604262637,
        "techType": "XGS-PON"
    },
    {
        "id": 250,
        "street": "Ратушного Романа",
        "house": "31",
        "lat": 50.41077905363848,
        "lng": 30.452642213610734,
        "techType": "XGS-PON"
    },
    {
        "id": 251,
        "street": "Ратушного Романа",
        "house": "33",
        "lat": 50.41576993440495,
        "lng": 30.448711506830236,
        "techType": "XGS-PON"
    },
    {
        "id": 252,
        "street": "Ратушного Романа",
        "house": "37",
        "lat": 50.42193023655406,
        "lng": 30.475849208848437,
        "techType": "GPON"
    },
    {
        "id": 253,
        "street": "Ратушного Романа",
        "house": "39",
        "lat": 50.44041264324929,
        "lng": 30.45768929704387,
        "techType": "XGS-PON"
    },
    {
        "id": 254,
        "street": "Ратушного Романа",
        "house": "4",
        "lat": 50.44106473300153,
        "lng": 30.481090447645382,
        "techType": "XGS-PON"
    },
    {
        "id": 255,
        "street": "Ратушного Романа",
        "house": "41",
        "lat": 50.445441307992375,
        "lng": 30.458313530858533,
        "techType": "GPON"
    },
    {
        "id": 256,
        "street": "Ратушного Романа",
        "house": "41а",
        "lat": 50.43688219485493,
        "lng": 30.46727716960711,
        "techType": "XGS-PON"
    },
    {
        "id": 257,
        "street": "Ратушного Романа",
        "house": "5",
        "lat": 50.43199463220656,
        "lng": 30.447190894937112,
        "techType": "XGS-PON"
    },
    {
        "id": 258,
        "street": "Ратушного Романа",
        "house": "6",
        "lat": 50.43666455602293,
        "lng": 30.45285664046059,
        "techType": "PLANNED"
    },
    {
        "id": 259,
        "street": "Ратушного Романа",
        "house": "9а",
        "lat": 50.42395120363856,
        "lng": 30.47889061273271,
        "techType": "XGS-PON"
    },
    {
        "id": 260,
        "street": "Роздільна",
        "house": "1",
        "lat": 50.44407457296241,
        "lng": 30.452956037304432,
        "techType": "XGS-PON"
    },
    {
        "id": 261,
        "street": "Роздільна",
        "house": "3",
        "lat": 50.42245972704415,
        "lng": 30.45853760328198,
        "techType": "XGS-PON"
    },
    {
        "id": 262,
        "street": "Роздільна",
        "house": "5",
        "lat": 50.432559832215375,
        "lng": 30.463448635166365,
        "techType": "XGS-PON"
    },
    {
        "id": 263,
        "street": "Семенівська",
        "house": "11",
        "lat": 50.435923957678035,
        "lng": 30.482605450025638,
        "techType": "GPON"
    },
    {
        "id": 264,
        "street": "Семенівська",
        "house": "13",
        "lat": 50.428992789787266,
        "lng": 30.481253709993723,
        "techType": "GPON"
    },
    {
        "id": 265,
        "street": "Семенівська",
        "house": "9",
        "lat": 50.418416816097775,
        "lng": 30.466102329579133,
        "techType": "XGS-PON"
    },
    {
        "id": 266,
        "street": "Сім'ї Житецьких",
        "house": "17",
        "lat": 50.43351032245906,
        "lng": 30.475382316606506,
        "techType": "GPON"
    },
    {
        "id": 267,
        "street": "Скрипника Мстислава Патріарха",
        "house": "11",
        "lat": 50.41550544426799,
        "lng": 30.468440575878603,
        "techType": "XGS-PON"
    },
    {
        "id": 268,
        "street": "Скрипника Мстислава Патріарха",
        "house": "13",
        "lat": 50.42746291562705,
        "lng": 30.479379713350134,
        "techType": "GPON"
    },
    {
        "id": 269,
        "street": "Скрипника Мстислава Патріарха",
        "house": "15",
        "lat": 50.4172428792483,
        "lng": 30.482148810489072,
        "techType": "XGS-PON"
    },
    {
        "id": 270,
        "street": "Скрипника Мстислава Патріарха",
        "house": "40",
        "lat": 50.43017705351204,
        "lng": 30.46884964706497,
        "techType": "XGS-PON"
    },
    {
        "id": 271,
        "street": "Скрипника Мстислава Патріарха",
        "house": "7",
        "lat": 50.409233135085856,
        "lng": 30.457695833150137,
        "techType": "GPON"
    },
    {
        "id": 272,
        "street": "Солом'янська",
        "house": "14",
        "lat": 50.42370387879385,
        "lng": 30.443744644674872,
        "techType": "GPON"
    },
    {
        "id": 273,
        "street": "Солом'янська",
        "house": "16",
        "lat": 50.415426951906795,
        "lng": 30.477737205187715,
        "techType": "PLANNED"
    },
    {
        "id": 274,
        "street": "Солом'янська",
        "house": "16б",
        "lat": 50.43492989308394,
        "lng": 30.463129383273643,
        "techType": "XGS-PON"
    },
    {
        "id": 275,
        "street": "Солом'янська",
        "house": "20а",
        "lat": 50.42615167551483,
        "lng": 30.447325880856607,
        "techType": "GPON"
    },
    {
        "id": 276,
        "street": "Солом'янська",
        "house": "20в",
        "lat": 50.422647908431365,
        "lng": 30.467082068962785,
        "techType": "PLANNED"
    },
    {
        "id": 277,
        "street": "Солом'янська",
        "house": "21",
        "lat": 50.44272564117918,
        "lng": 30.480046539601215,
        "techType": "GPON"
    },
    {
        "id": 278,
        "street": "Солом'янська",
        "house": "22",
        "lat": 50.44619151834599,
        "lng": 30.469973752205846,
        "techType": "XGS-PON"
    },
    {
        "id": 279,
        "street": "Солом'янська",
        "house": "24",
        "lat": 50.42043640404609,
        "lng": 30.471816172751772,
        "techType": "GPON"
    },
    {
        "id": 280,
        "street": "Солом'янська",
        "house": "27",
        "lat": 50.43020979133285,
        "lng": 30.44388307209322,
        "techType": "XGS-PON"
    },
    {
        "id": 281,
        "street": "Солом'янська",
        "house": "28",
        "lat": 50.4445601440178,
        "lng": 30.469852954254687,
        "techType": "XGS-PON"
    },
    {
        "id": 282,
        "street": "Солом'янська",
        "house": "29",
        "lat": 50.43359086030518,
        "lng": 30.475736825214838,
        "techType": "XGS-PON"
    },
    {
        "id": 283,
        "street": "Солом'янська",
        "house": "30",
        "lat": 50.42842196877542,
        "lng": 30.472079737488734,
        "techType": "PLANNED"
    },
    {
        "id": 284,
        "street": "Солом'янська",
        "house": "31",
        "lat": 50.439056321651044,
        "lng": 30.473620658602297,
        "techType": "XGS-PON"
    },
    {
        "id": 285,
        "street": "Солом'янська",
        "house": "32",
        "lat": 50.42467889935416,
        "lng": 30.477445305659646,
        "techType": "XGS-PON"
    },
    {
        "id": 286,
        "street": "Солом'янська",
        "house": "33",
        "lat": 50.41542471183925,
        "lng": 30.460072699573566,
        "techType": "XGS-PON"
    },
    {
        "id": 287,
        "street": "Солом'янська",
        "house": "34",
        "lat": 50.4289714275136,
        "lng": 30.459999461562774,
        "techType": "XGS-PON"
    },
    {
        "id": 288,
        "street": "Солом'янська",
        "house": "35",
        "lat": 50.40905977859451,
        "lng": 30.449861394813865,
        "techType": "XGS-PON"
    },
    {
        "id": 289,
        "street": "Солом'янська",
        "house": "36",
        "lat": 50.408302135573926,
        "lng": 30.46576178446038,
        "techType": "XGS-PON"
    },
    {
        "id": 290,
        "street": "Солом'янська",
        "house": "37",
        "lat": 50.44191421022134,
        "lng": 30.4733441045015,
        "techType": "XGS-PON"
    },
    {
        "id": 291,
        "street": "Солом'янська",
        "house": "38",
        "lat": 50.42091746594177,
        "lng": 30.449819680788213,
        "techType": "PLANNED"
    },
    {
        "id": 292,
        "street": "Солом'янська",
        "house": "39",
        "lat": 50.41228608425504,
        "lng": 30.48083108517474,
        "techType": "XGS-PON"
    },
    {
        "id": 293,
        "street": "Солом'янська",
        "house": "41",
        "lat": 50.411035789330924,
        "lng": 30.47011879365644,
        "techType": "GPON"
    },
    {
        "id": 294,
        "street": "Солом'янська",
        "house": "41а",
        "lat": 50.42871022121739,
        "lng": 30.44858691512357,
        "techType": "GPON"
    },
    {
        "id": 295,
        "street": "Солом'янська",
        "house": "41к2",
        "lat": 50.41276053124238,
        "lng": 30.444693736134653,
        "techType": "PLANNED"
    },
    {
        "id": 296,
        "street": "Стадіонна",
        "house": "16/6",
        "lat": 50.40950423039507,
        "lng": 30.478292890659194,
        "techType": "XGS-PON"
    },
    {
        "id": 297,
        "street": "Стадіонна",
        "house": "6",
        "lat": 50.43030046048671,
        "lng": 30.478245437099265,
        "techType": "XGS-PON"
    },
    {
        "id": 298,
        "street": "Тополева",
        "house": "4/8",
        "lat": 50.41755511438289,
        "lng": 30.471335659395578,
        "techType": "GPON"
    },
    {
        "id": 299,
        "street": "Уманська",
        "house": "7",
        "lat": 50.41459714811923,
        "lng": 30.46151915534317,
        "techType": "XGS-PON"
    },
    {
        "id": 300,
        "street": "Шаповала Генерала",
        "house": "2",
        "lat": 50.41244556068763,
        "lng": 30.464755535329395,
        "techType": "GPON"
    },
    {
        "id": 301,
        "street": "Шаповала Генерала",
        "house": "2а",
        "lat": 50.4079791823093,
        "lng": 30.47692075027011,
        "techType": "PLANNED"
    },
    {
        "id": 302,
        "street": "Яновського Феофіла",
        "house": "1",
        "lat": 50.43324610874679,
        "lng": 30.453966184889254,
        "techType": "XGS-PON"
    },
    {
        "id": 303,
        "street": "Яновського Феофіла",
        "house": "1а",
        "lat": 50.41858363681866,
        "lng": 30.468396400589086,
        "techType": "XGS-PON"
    },
    {
        "id": 304,
        "street": "Яновського Феофіла",
        "house": "2",
        "lat": 50.4441533432935,
        "lng": 30.47997076172879,
        "techType": "XGS-PON"
    },
    {
        "id": 305,
        "street": "Яновського Феофіла",
        "house": "3а",
        "lat": 50.44239624951608,
        "lng": 30.45077466983078,
        "techType": "PLANNED"
    },
    {
        "id": 306,
        "street": "Яслинська",
        "house": "11б",
        "lat": 50.406703050852116,
        "lng": 30.467217228865476,
        "techType": "GPON"
    }
];
