const InfoBlock = () => {
    return ( 
        <div className={` font-normal text-white flex flex-col w-[1110px] mb-[120px]`}>
            <h1 className={`font-semibold`}>Про компанію</h1>
            <p className={`mb-5`}>Компанія Batyevka.NET - це надійний постачальник високоякісного інтернету, який перевірений роками. Ми надаємо послуги тисячам задоволених городян, успішно зарекомендувавши себе як хорошого, стабільного провайдера і спеціалізуємося на підключенні до телебачення та Internet.</p>
            <p className={`mb-5`}>Batyevka.NET - інтернет провайдер, який стійко витримує жорстку конкуренцію столиці і при цьому зберігає умови лояльної цінової політики, стосовно своїх клієнтів. Ми працюємо як з фізичними, так і юридичними особами і наші тарифи доступні для всіх мешканців міста. Ми завжди відкриті для співробітництва та готові надати широкий пакет послуг кожному. Наш клієнт - це наш друг, тому ми працюємо так, щоб підключити інтернет у Києві було для вас максимально просто. Наша команда — це команда професіоналів своєї справи, які готові надати безперебійний доступ до всесвітньої мережі з будь-якої точки міста в режимі 24/7. Наша головна мета - задоволений замовник, тому ми знаємо, що таке індивідуальний підхід до кожного.</p>
            <h1 className={`font-semibold`}>Чому варто вибрати саме нас?</h1>
            <p className={`mb-5`}>Існує кілька важливих причин, через які жителям Солом'янського району столиці потрібно вибрати нашу компанію:</p>
            <p>1. Якість</p>
            <p className={`ml-[13px]`}>Головне, чим ми можемо по-праву пишатися — це можливість користувача мати цілодобовий доступ до високоякісного інтернету.</p>
            <p>2. Ціна</p>
            <p className={`ml-[13px]`}>Грамотний підхід до питань цінової політики робить Batyevka.NET доступним усім і кожному.</p>
            <p>3. Вибір</p>
            <p className={`ml-[13px] mb-5`}>Великий спектр тематичних послуг дозволяє нашій команді залишатися затребуваною для замовника. Наприклад, підключивши домашній інтернет, ви завжди можете розраховувати на цілодобову технічну підтримку.</p>
            <p className={`mb-5`}>У роботі ми використовуємо виключно високоякісне технічне обладнання та комплектуючі. Ми уважно стежимо за всіма інноваціями у сфері телекомунікацій. Наші фахівці не перестають удосконалювати себе, свої знання, покращуючи тим самим якість обслуговування та заробляючи необхідний досвід. Ми прагнемо до досконалості постійно оновлюючи та розширюючи перелік послуг та роблячи їх доступнішими для клієнта. Ми пишаємося тим, що довіра столичних жителів зростає з кожним днем, як і кількість задоволених клієнтів фірми.</p>
            <p className={`mb-5`}>Підключення до інтернету Batyevka.NET регулярно проводить у багатоповерхових будинках, використовуючи оптичне волокно GPON або мідний кабель UTP. Наша унікальна технологія підв'язки до глобальної мережі FTTH (волокно в під'їзд та мідний кабель у квартиру) дає можливість досягти швидкості до 1 ГІГАБІТУ!</p>
            <p className={`mb-5`}>Підключивши інтернет ви отримаєте справжнє задоволення від переглядів фільмів онлайн, інтернет серфінгу, а також можливостей грати в улюблені онлайн-ігри з найкоротшим ping у місті.</p>
            <p className={`mb-5`}>Використання маршрутизаторів Cisco дають можливість контролювати трафік, забезпечуючи абонентів максимальну швидкість підключення Internet.</p>
            <p className={`mb-5`}>Якщо у вас виникли питання, ви завжди можете звернутися за консультацією Online, або зателефонувавши до нас по одному з телефонів, вказаних у розділі «контакти». Бажаєте стати нашим новим абонентом? Звертайтесь, ми завжди радо зустрічаємо нових клієнтів!</p>
        </div>
     );
}
 
export default InfoBlock;